workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-apiKey-cpu1-hey.txt

Summary:
  Total:	90.0974 secs
  Slowest:	0.0451 secs
  Fastest:	0.0002 secs
  Average:	0.0180 secs
  Requests/sec:	11099.0950
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [63]	|
  0.009 [132]	|
  0.014 [292]	|
  0.018 [711453]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [276339]	|■■■■■■■■■■■■■■■■
  0.027 [11579]	|■
  0.032 [16]	|
  0.036 [42]	|
  0.041 [54]	|
  0.045 [29]	|


Latency distribution:
  10%% in 0.0165 secs
  25%% in 0.0168 secs
  50%% in 0.0174 secs
  75%% in 0.0183 secs
  90%% in 0.0212 secs
  95%% in 0.0218 secs
  99%% in 0.0227 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0046 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0031 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	0.0180 secs, 0.0001 secs, 0.0416 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [201]	1000000 responses