workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-apiKey-cpu16-hey.txt

Summary:
  Total:	7.1371 secs
  Slowest:	0.0734 secs
  Fastest:	0.0002 secs
  Average:	0.0014 secs
  Requests/sec:	140112.4729
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [999045]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [718]	|
  0.022 [27]	|
  0.029 [23]	|
  0.037 [15]	|
  0.044 [113]	|
  0.051 [24]	|
  0.059 [19]	|
  0.066 [8]	|
  0.073 [7]	|


Latency distribution:
  10%% in 0.0008 secs
  25%% in 0.0010 secs
  50%% in 0.0013 secs
  75%% in 0.0016 secs
  90%% in 0.0020 secs
  95%% in 0.0024 secs
  99%% in 0.0035 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0061 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0036 secs
  resp wait:	0.0014 secs, 0.0001 secs, 0.0674 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [201]	1000000 responses