workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-apiKey-cpu2-hey.txt

Summary:
  Total:	45.7571 secs
  Slowest:	0.0310 secs
  Fastest:	0.0002 secs
  Average:	0.0091 secs
  Requests/sec:	21854.5509
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [321]	|
  0.006 [1214]	|
  0.009 [681213]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [292241]	|■■■■■■■■■■■■■■■■■
  0.016 [23938]	|■
  0.019 [865]	|
  0.022 [69]	|
  0.025 [40]	|
  0.028 [60]	|
  0.031 [38]	|


Latency distribution:
  10%% in 0.0078 secs
  25%% in 0.0083 secs
  50%% in 0.0089 secs
  75%% in 0.0096 secs
  90%% in 0.0109 secs
  95%% in 0.0117 secs
  99%% in 0.0134 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0049 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0091 secs, 0.0001 secs, 0.0261 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [201]	1000000 responses