workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-apiKey-cpu4-hey.txt

Summary:
  Total:	22.8880 secs
  Slowest:	0.0301 secs
  Fastest:	0.0002 secs
  Average:	0.0046 secs
  Requests/sec:	43691.0217
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [136847]	|■■■■■■■
  0.006 [745783]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [114028]	|■■■■■■
  0.012 [3084]	|
  0.015 [61]	|
  0.018 [28]	|
  0.021 [27]	|
  0.024 [59]	|
  0.027 [64]	|
  0.030 [18]	|


Latency distribution:
  10%% in 0.0029 secs
  25%% in 0.0036 secs
  50%% in 0.0045 secs
  75%% in 0.0054 secs
  90%% in 0.0063 secs
  95%% in 0.0069 secs
  99%% in 0.0082 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0064 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0059 secs
  resp wait:	0.0045 secs, 0.0001 secs, 0.0255 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [201]	1000000 responses