workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-apiKey-cpu8-hey.txt

Summary:
  Total:	11.5230 secs
  Slowest:	0.0416 secs
  Fastest:	0.0001 secs
  Average:	0.0023 secs
  Requests/sec:	86783.1262
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [979295]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [20463]	|■
  0.013 [41]	|
  0.017 [0]	|
  0.021 [0]	|
  0.025 [0]	|
  0.029 [3]	|
  0.033 [70]	|
  0.037 [92]	|
  0.042 [35]	|


Latency distribution:
  10%% in 0.0014 secs
  25%% in 0.0017 secs
  50%% in 0.0022 secs
  75%% in 0.0027 secs
  90%% in 0.0033 secs
  95%% in 0.0037 secs
  99%% in 0.0048 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0031 secs
  resp wait:	0.0023 secs, 0.0001 secs, 0.0401 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [201]	1000000 responses