workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-ipWhiteList-cpu1-hey.txt

Summary:
  Total:	91.5112 secs
  Slowest:	0.0504 secs
  Fastest:	0.0004 secs
  Average:	0.0183 secs
  Requests/sec:	10927.6235
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [114]	|
  0.010 [147]	|
  0.015 [559]	|
  0.020 [824488]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [174458]	|■■■■■■■■
  0.030 [84]	|
  0.035 [20]	|
  0.040 [38]	|
  0.045 [63]	|
  0.050 [28]	|


Latency distribution:
  10%% in 0.0167 secs
  25%% in 0.0171 secs
  50%% in 0.0177 secs
  75%% in 0.0187 secs
  90%% in 0.0215 secs
  95%% in 0.0221 secs
  99%% in 0.0230 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0045 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0032 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0022 secs
  resp wait:	0.0183 secs, 0.0004 secs, 0.0463 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	1000000 responses