workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-ipWhiteList-cpu2-hey.txt

Summary:
  Total:	46.3582 secs
  Slowest:	0.0362 secs
  Fastest:	0.0002 secs
  Average:	0.0093 secs
  Requests/sec:	21571.1509
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [370]	|
  0.007 [20946]	|■
  0.011 [873955]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [101340]	|■■■■■
  0.018 [3159]	|
  0.022 [52]	|
  0.025 [55]	|
  0.029 [49]	|
  0.033 [41]	|
  0.036 [32]	|


Latency distribution:
  10%% in 0.0079 secs
  25%% in 0.0084 secs
  50%% in 0.0090 secs
  75%% in 0.0098 secs
  90%% in 0.0110 secs
  95%% in 0.0119 secs
  99%% in 0.0135 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0073 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0040 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0040 secs
  resp wait:	0.0093 secs, 0.0001 secs, 0.0288 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [201]	1000000 responses