workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-ipWhiteList-cpu4-hey.txt

Summary:
  Total:	23.0468 secs
  Slowest:	0.0314 secs
  Fastest:	0.0001 secs
  Average:	0.0046 secs
  Requests/sec:	43389.9264
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [150886]	|■■■■■■■■
  0.006 [756752]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [90383]	|■■■■■
  0.013 [1761]	|
  0.016 [27]	|
  0.019 [29]	|
  0.022 [18]	|
  0.025 [31]	|
  0.028 [69]	|
  0.031 [43]	|


Latency distribution:
  10%% in 0.0030 secs
  25%% in 0.0037 secs
  50%% in 0.0045 secs
  75%% in 0.0054 secs
  90%% in 0.0063 secs
  95%% in 0.0069 secs
  99%% in 0.0082 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0068 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0044 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	0.0046 secs, 0.0001 secs, 0.0260 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [201]	1000000 responses