workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-ipWhiteList-cpu8-hey.txt

Summary:
  Total:	11.7320 secs
  Slowest:	0.0491 secs
  Fastest:	0.0002 secs
  Average:	0.0023 secs
  Requests/sec:	85237.1228
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [992533]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [7156]	|
  0.015 [73]	|
  0.020 [57]	|
  0.025 [3]	|
  0.030 [43]	|
  0.034 [82]	|
  0.039 [11]	|
  0.044 [13]	|
  0.049 [28]	|


Latency distribution:
  10%% in 0.0014 secs
  25%% in 0.0018 secs
  50%% in 0.0022 secs
  75%% in 0.0028 secs
  90%% in 0.0034 secs
  95%% in 0.0038 secs
  99%% in 0.0048 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0050 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0037 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0041 secs
  resp wait:	0.0023 secs, 0.0001 secs, 0.0446 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0047 secs

Status code distribution:
  [201]	1000000 responses