workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-jwt-cpu1-hey.txt

Summary:
  Total:	101.2091 secs
  Slowest:	0.0507 secs
  Fastest:	0.0002 secs
  Average:	0.0202 secs
  Requests/sec:	9880.5328
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [81]	|
  0.010 [82]	|
  0.015 [293]	|
  0.020 [697388]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [295963]	|■■■■■■■■■■■■■■■■■
  0.031 [6068]	|
  0.036 [40]	|
  0.041 [43]	|
  0.046 [20]	|
  0.051 [21]	|


Latency distribution:
  10%% in 0.0184 secs
  25%% in 0.0188 secs
  50%% in 0.0195 secs
  75%% in 0.0211 secs
  90%% in 0.0236 secs
  95%% in 0.0242 secs
  99%% in 0.0252 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0048 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0202 secs, 0.0002 secs, 0.0455 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [201]	1000000 responses