workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-jwt-cpu16-hey.txt

Summary:
  Total:	7.8947 secs
  Slowest:	0.0763 secs
  Fastest:	0.0002 secs
  Average:	0.0016 secs
  Requests/sec:	126666.4869
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [998918]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [818]	|
  0.023 [37]	|
  0.031 [23]	|
  0.038 [17]	|
  0.046 [18]	|
  0.053 [91]	|
  0.061 [42]	|
  0.069 [25]	|
  0.076 [10]	|


Latency distribution:
  10%% in 0.0009 secs
  25%% in 0.0011 secs
  50%% in 0.0014 secs
  75%% in 0.0018 secs
  90%% in 0.0023 secs
  95%% in 0.0027 secs
  99%% in 0.0044 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0065 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0015 secs, 0.0002 secs, 0.0703 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [201]	1000000 responses