workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-jwt-cpu2-hey.txt

Summary:
  Total:	51.1447 secs
  Slowest:	0.0348 secs
  Fastest:	0.0002 secs
  Average:	0.0102 secs
  Requests/sec:	19552.3793
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [341]	|
  0.007 [1060]	|
  0.011 [687883]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.014 [289954]	|■■■■■■■■■■■■■■■■■
  0.017 [20008]	|■
  0.021 [592]	|
  0.024 [40]	|
  0.028 [32]	|
  0.031 [46]	|
  0.035 [43]	|


Latency distribution:
  10%% in 0.0087 secs
  25%% in 0.0093 secs
  50%% in 0.0099 secs
  75%% in 0.0108 secs
  90%% in 0.0122 secs
  95%% in 0.0131 secs
  99%% in 0.0147 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0082 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0051 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0029 secs
  resp wait:	0.0102 secs, 0.0002 secs, 0.0293 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0010 secs

Status code distribution:
  [201]	1000000 responses