workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-jwt-cpu4-hey.txt

Summary:
  Total:	25.4605 secs
  Slowest:	0.0292 secs
  Fastest:	0.0002 secs
  Average:	0.0051 secs
  Requests/sec:	39276.5588
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [70041]	|■■■■
  0.006 [682013]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [235381]	|■■■■■■■■■■■■■■
  0.012 [12083]	|■
  0.015 [281]	|
  0.018 [19]	|
  0.021 [20]	|
  0.023 [79]	|
  0.026 [70]	|
  0.029 [12]	|


Latency distribution:
  10%% in 0.0033 secs
  25%% in 0.0041 secs
  50%% in 0.0050 secs
  75%% in 0.0060 secs
  90%% in 0.0070 secs
  95%% in 0.0077 secs
  99%% in 0.0091 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0064 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0063 secs
  resp wait:	0.0051 secs, 0.0001 secs, 0.0232 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0012 secs

Status code distribution:
  [201]	1000000 responses