workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-jwt-cpu8-hey.txt

Summary:
  Total:	13.0073 secs
  Slowest:	0.0427 secs
  Fastest:	0.0002 secs
  Average:	0.0026 secs
  Requests/sec:	76879.7747
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [958991]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [40668]	|■■
  0.013 [140]	|
  0.017 [0]	|
  0.021 [0]	|
  0.026 [0]	|
  0.030 [0]	|
  0.034 [54]	|
  0.038 [60]	|
  0.043 [86]	|


Latency distribution:
  10%% in 0.0015 secs
  25%% in 0.0020 secs
  50%% in 0.0025 secs
  75%% in 0.0031 secs
  90%% in 0.0038 secs
  95%% in 0.0043 secs
  99%% in 0.0054 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0063 secs
  resp wait:	0.0026 secs, 0.0002 secs, 0.0377 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0027 secs

Status code distribution:
  [201]	1000000 responses